{"1":["                              The distorting effect of deciding to stop sampling\n                                                 Anna Coenen and Todd M. Gureckis\n                          Department of Psychology, NYU, 6 Washington Place, New York, NY 10003 USA\n                                                 {anna.coenen, todd.gureckis}@nyu.edu\n                              Abstract                                 to trade-off reward and information (e.g. Denrell & March,\n   People usually collect information to serve specific goals and      2001; Rich & Gureckis, 2014) or when feedback is asym-\n   often end up with samples that are unrepresentative of the un-      metric across different choice options (Le Mens & Denrell,\n   derlying population. This can introduce biases on later judg-       2011).\n   ments that generalize from these samples. Here we show that\n   goals influence not only what information we collect, but also         Unlike selective sampling, natural sampling refers to the\n   when we decide to terminate search. Using an optimal stop-          process of drawing samples directly from the generating dis-\n   ping analysis, we demonstrate that even when learners have no       tribution without conditioning queries on any particular as-\n   control over the content of a sample (i.e., natural sampling),\n   the simple decision of when to stop sampling can yield sample       pects of the sample. For example, a natural sample of busi-\n   distributions that are non-representative and could potentially     nesses could be obtained by randomly selecting a number of\n   bias future decision making. We test the prediction of these        companies that were founded in a specific year, irrespective\n   theoretical analyses with two behavioral experiments.\n                                                                       of their subsequent success. As noted above, natural sam-\n   Keywords: information search; stopping rules; sampling;             pling is often considered a remedy for biases introduced by\n   decision-making\n                                                                       selective sampling because it enables learners to “conserve\n                          Introduction                                 the properties of the universe” (Fiedler, 2008), such that the\n                                                                       distribution of the sample will mirror the distribution of the\nInformation search typically improves judgment and decision\n                                                                       source in an unbiased fashion.\nmaking by reducing uncertainty about the the world. Imagine\n                                                                          However, even during natural sampling learners can often\ntrying to research what qualities make a good business man-\n                                                                       make the decision when to terminate search which may in\nager prior to making a hiring decision. To achieve this goal,\n                                                                       turn be influenced by their goals (see e.g., Juni et al., in press;\nit might make sense to look at the characteristics of CEOs\n                                                                       Lee & Paradowski, 2007; Vul et al., 2014). Here, we will\nof successful companies and find out what they have in com-\n                                                                       argue that optimal goal-induced stopping decisions can lead\nmon. In this case, your research seems to add information,\n                                                                       to potentially non-representative samples even when they are\nimproving your ability to decide. However, no matter how\n                                                                       generated by natural sampling. In particular, using an optimal\nmuch data you collect, it would be a fallacy (and one that\n                                                                       stopping analysis we show that goals can have a powerful\npeople often commit) to make the inverse inference that man-\n                                                                       impact not only on the size of samples that learners collect,\nagers with those characteristics will necessarily lead compa-\n                                                                       but also on the content and distributional characteristics of\nnies to success (Denrell, 2003). In this case, the way in which\n                                                                       those samples. We then show how such samples may not\ninformation is collected can strongly bias judgment and deci-\n                                                                       reflect the statistical properties of the original distributions\nsion making.\n                                                                       and how they could later on produce biased decisions in a\n   This scenario points to a common problem we encounter\n                                                                       naive learner. We finally examine these model predictions\nwhen sampling the world. In most cases, the information we\n                                                                       with two behavioral experiments.\nobtain is not random, but rather tailored to our specific goals.\nBiases can arise when the information we collect with one                   An optimal stopping analysis for natural\ngoal or objective in mind is used to make later decisions per-\ntaining to different goals. To give another example, imagine                         sampling of binary outcomes\nthat we had sampled more broadly CEOs from both success-               To demonstrate the impact of stopping on sample compo-\nful and unsuccessful companies to help answer the question             sition, consider a simple information search task in which\nwhat makes companies successful. Even though that broader              learners repeatedly observe binary outcomes from a distri-\nsample is now more suitable to answer that question, it would          bution of interest. For example, learners could be picking\nstill be unhelpful for answering other questions, like whether         either good or bad apples in order to learn something about\ncollege dropouts do better than graduates in their subsequent          the quality of the tree. The tree will have some probability of\ncareers. In this paper, we examine the relationship between            yielding good and bad apples, but learners have to rely on a\nsearch goals, information sampling decisions, and prediction.          finite sample of apples to estimate this probability.\n                                                                          Such a binary task can be modeled as a Bernoulli process\nSelective versus natural sampling                                      (a coin flip essentially) with two possible outcomes (heads or\nExamples of biased sampling such as those reviewed above               tails) with the outcome probability q (probability of heads).\ntypically involve selective sampling, when learners have con-          Assume that the learner incurs a small cost c for every draw\ntrol over what they sample (e.g., only successful managers).           of the distribution (every coin flip). Let’s also assume that the\nIn addition to the example of conditional reasoning, selec-            learner will subsequently have to answer one of the following\ntive sampling biases have also been shown when people have             two questions (sampling goals).\n                                                                   2819\n"],"2":["1. Binary: Find out if q is greater than 0.5 (“Is the coin biased     where w0.2 is a boxcar function with a .2 wide interval. By\n    towards heads or tails?”).                                        convolving it with the posterior over q it can be used to find\n                                                                      the interval with the largest posterior density.\n2. Estimation: Find out the value of q (“What is the bias of\n    the coin?”).                                                      Predictions\n    Each goal is associated with a different reward that is a         To predict behavior using this model, we first need to choose\n function of the true value of q and the participant’s estimate.      values for sampling cost, c, potential reward of the secondary\n The learner’s task is to decide when to stop sampling and pro-       task, r, and the maximum number of trials (the length of the\n vide their estimate given this cost function, the current sample     horizon), T . To generate more realistic predictions, we ad-\n (heads and tails), and the sampling cost. Assuming that there        ditionally assume some stochasticity in people’s choice be-\n exists a maximum number of samples that learners are al-             havior by using a probabilistic choice rule instead of the\n lowed to draw this can be framed as an finite-horizon optimal        max() operator in Equation (1). For example, using a soft-\n stopping problem. At every possible state (defined by the size       max choice rule yields the following probability of stopping\n                                                                                                  exp(V /t)\n of the current sample, n, and number of heads in that sample,        at each state, Pstop = exp((Vstopstop\n                                                                                                       +Vcont )/t) . It requires specify-\n hn ), an optimal decision maker should compare the expected          ing an additional temperature parameter, t which governs the\n value of stopping and of continuing and choose whichever is          degree of probabilistic responding (when t = 0 it chooses the\n higher. Thus the expected value of a state, given a horizon of       maximum value, as t ! • it chooses randomly). In this paper\n a maximum of T flips is                                              we will use the following parameter settings to derive model\n                     (T )\n                                                                      predictions: T = 24, c = $0.03, r = $2, t = .02. These values\n                    Vn (n, hn ) = max {Vstop ,Vcont }         (1)     were chosen for illustrative purposes and many qualitative re-\n                                                                      sults hold across a broader range of values (as long as the\n where\n                                                                      trade-off between c and r leads to stopping after a number\n                        Vstop = ustop (n, hn )   nc           (2)\n                                                                      of samples but before the horizon is reached). The model\n and                                                                  was used to derive predictions for the expected sample size,\n                                  (T )\n                     Vcont = E[Vn+1 (n + 1, hn+1 )]           (3)     stopping probabilities, and the composition of samples after\n                                                                      stopping.\n and where ustop (.) is the expected utility of the post-sampling\n task, which depends on a learner’s sampling goal (see be-            Stopping Figure 1A shows the model’s predictions for the\n low). The value of continuing to obtain another sample is            learner’s decisions to stop (white) or continue (green) given\n a learner’s expectation over possible future states given their      the current state (outcomes observed so far). Under the bi-\n current knowledge. The probabilities in the expectation are          nary goal, learners’ should continue sampling if the current\n based on a beta distribution parameterized by the outcomes           sample is balanced (similar proportion of heads and tails) and\n observed so far. The value of the final state (when n = T )          be more likely to stop when a sample is more extreme. In\n is just the expected value of stopping, which, along with            contrast, the estimation goal leads to a greater probability to\n the Markov property, means that this problem is solvable by          continue sampling in a much broader range of states. This\n backwards induction (Ferguson, 2012).                                is unsurprising because estimation requires a representative\n    To compute the utility of stopping under the binary goal,         sample and overall more data than binary choice. A perhaps\n note that the probability of a coin being biased towards heads       more surprising and subtle prediction is that the probability is\n is P(q > .5) = 1 I0.5 (a, b), where Ix (a, b) is the cumulative      not uniform for each sample size, but shows a slight pattern of\n distribution function of the beta distribution with parameters       earlier stopping for both very extreme and very balanced sam-\n a = h + 1 and b = (n h) + 1. Assuming that the learner               ples. Both patterns are caused by a learner’s expected success\n chooses heads when P(q > .5) > 0.5 and tails otherwise, their        at the estimation task. When samples are extreme, expected\n expected utility for stopping is                                     accuracy is high and learners can stop earlier with a reason-\n                                                                      able chance at success. When samples are very mixed (close\n               ubin\n                stop = max {1     I0.5 (a, b), I0.5 (a, b)} r (4)     to 0.5 average), a high chance of good performance would re-\n                                                                      quire too many costly samples, at which point stopping early\n where r is the reward for making a correct choice.\n                                                                      and making a best guess might have higher expected value.\n    The expected utility from stopping under the estimation\n                                                                      Basically mixed samples tend to take too many costs samples\n goal requires specifying a cost function over the distance be-\n                                                                      to resolve accurately.\n tween the participant’s estimate and q. For simplicity’s sake,\n assume that the learner’s answer counts as correct whenever             From the stopping matrices in Figure 1A one can now de-\n their response lies within a .2 interval surrounding the true        rive expected probabilities for stopping points, that is learn-\n value, and incorrect otherwise. The expected utility from            ers’ expected final state after stopping, for specific values of\n stopping under this goal is                                          q. Figure 1B shows the likelihood of different stopping points\n                                                                      assuming q = 0.5. As expected, binary learners are predicted\n                         ⇢Z 1\n           est                                                        to end up in early extreme states (all heads or all tails) or later\n         ustop = max          Beta(x; a, b)w0.2 (q x)dx r     (5)     mixed states, whereas estimation learners show a wider dis-\n                     q      0\n                                                                  2820\n"],"3":["                                                                                      A                                          B                       C\n A                                                                                              0.15                             0.3                           condition\n                                                                                                                      binary\n                      binary                             estimate                                                                                        0.3\n                                                                                                0.10\n                                                                                                                                                                     binary\n                                                                                  Probability\n                                                                                                0.05                             0.2\n                                                                                                0.00                                                     0.2         estimate\n         20\n                                                                                                                      estimate\n                                                                                                0.15                             0.1                     0.1\n                                                                                                0.10\n         15                                                                                     0.05\n                                                                                                                                                         0.0\n                                                                                                                                 0.0\n heads\n                                                                                                0.00\n                                                                                                       0 5 10 15 20 25                 0.0   0.4   0.8         0.0            0.4   0.8\n         10                                                                                             Sample size\n          5\n                                                                                  Figure 2: A: Distribution of sample size by condition, using uni-\n          0\n                                                                                  form q. B and C: Predicted distribution of sample averages, using\n                                                                                  q = 0.5, and q = 0.7.\n              0   5   10       15   20           0   5   10     15   20\n                                         tails\n B                    binary                             estimate\n                                                                                  tion, sample means fall around the expected value of the dis-\n         25\n                                                                                  tribution, whereas the binary condition leads to many samples\n         20\n                                                                                  with only one type of outcome (all heads or all tails). Note\n         15                                                                       that these more extreme samples tend to be small (that’s when\n heads   10\n                                                                                  learners terminate early), but they still mostly contain more\n                                                                                  than one observation, which can be seen from Figure 1A.\n          5                                                                       Thus, the difference in sample mean distributions between\n                                                                                  the two goals is not just due to the fact that the binary con-\n          0\n                                                                                  dition leads to samples of size 1 which necessarily have an\n              0   5   10   15       20     25    0   5   10    15    20   25\n                                           tails                                  average of 0 or 1.\n                                                                                  Summary This analysis shows how sampling goals can in-\nFigure 1: Model Predictions. A: Probability of continuing (green)\nor stopping (white) given observed data. B: Probability of having                 fluence on learners’ expected stopping strategies even in a\nstopped in any given state. Modeled using uniform q.                              very simple binary sampling task. Furthermore, even though\n                                                                                  the model gives learners no influence on what to sample and\n                                                                                  it assumes they are choosing optimally, the resulting distri-\ntribution of stopping states.                                                     bution of samples is not necessarily representative of the un-\nSample Size Figure 2A shows the expected distribution of                          derlying generating probabilities. Instead, sampling with the\nnumber of total samples taken, assuming learners are sam-                         binary goal leads to far more samples with extreme averages\npling from a process with underlying q = 0.5. Estimation                          than the estimation goal, which generates more representative\nlearners are expected to collect more samples than binary                         samples.\nlearners, who face an easier secondary task and therefore ter-                       This illustrates that even in natural sampling tasks, in\nminate earlier on average.                                                        which samples generally “conserve the properties of the uni-\n                                                                                  verse” Fiedler (2008) optimal stopping rules can distort the\nSample Composition The fact that stopping rules affect ex-\n                                                                                  experienced data depending on the learner’s goal during the\npected size of samples is not surprising given the different\n                                                                                  sampling. In other words, even the minimal decision of\nloss functions of the two goals. A more intriguing question\n                                                                                  when to stop can introduce systematic discrepancies between\nis whether sampling goals also preserve the properties of the\n                                                                                  a sample and the population distribution.\ndistribution that generates each sample. To investigate this,\nwe will consider the proportion of heads and tails within each\n                                                                                                                                       Experiments\nsample, after repeatedly sampling and stopping under the two\ngoals. We expect that binary sampling would on average lead                       These theoretical results yield a number of interesting em-\nto more unequal samples (all heads, or all tails) since its stop-                 pirical questions, which will be addressed with two ex-\nping rule terminates early when outcomes are extreme (after                       periments. First, the model uses a relatively sophisticated\ntwo or three heads one can be pretty confident that heads is                      forward-looking, optimal decision-making process to gov-\nmore common, for example) and continues when early out-                           ern people’s stopping decisions. The behavioral patterns in\ncomes are mixed (after one tails and two heads a decider                          Figure 1 require not only that learners can assess the cost-\nmight want to flip the coin at least one more time to be sure).                   accuracy trade-off and adjust the number of samples accord-\nOn the other hand the estimation condition predicts a wider                       ingly. They need to also be able to assess the expected perfor-\narray of stopping points because the goal is to get an accurate                   mance given the current sample content. In the following two\npicture of the average outcome probability.                                       experiments we will therefore examine to what degree partic-\n   Figures 2B and C confirm this effect of stopping rule on                       ipants are actually engaging in such forward looking behavior\nsample composition. It shows the expected frequency distri-                       when deciding to terminate or continue sampling.\nbution of sample averages under each sampling goal, when                             Both experiments will also examine how goals affect sam-\nthe true q = 0.5(A) or q = 0.7(B). In the estimation condi-                       ple composition, compared to the predictions of the model. A\n                                                                               2821\n"],"4":["key intention of the modeling effort above was to show that           A 1500                                  B                        condition\ndistributions of sample means differ depending on the goal,\n                                                                                                   binary\n                                                                              1000                                                        Binary\n                                                                                                              Participants\nwhich suggests that even natural sampling does not preserve                    500                                       1000             Estimate\npopulation characteristics in a straightforward manner.               count\n                                                                                 0\n                                                                              1500\n                                                                                                                             500\n                                                                                                   estimate\n   Another question, albeit one that is more difficult to an-                 1000\nswer, is whether people’s judgments about the distribution                     500\nthat generates the samples are affected by the different sam-                    0                                            0\npling strategies. For example, since binary sampling, accord-                        0 5 10 15 20 25                               0.00 0.25 0.50 0.75 1.00\n                                                                                      sampleSize                                         Sample mean\ning to the model, should produce more extreme samples, does\nthis lead people to expect more extreme outcomes? Experi-             Figure 3:     A: Histogram of sample sizes in Experiment 1.\nment 2 starts to address this question and yields some prelim-        B:Distribution of sample averages in Experiment 1.\ninary results.\nExperiment 1                                                          slider whose handle had two lines that indicated the .2 interval\nExperiment 1 manipulated sampling goals in a simple re-               within which their response would be counted as correct. Af-\npeated Bernoulli sampling task that shared all the character-         ter giving their estimate, all 200 cards of the card deck were\nistics of the task described in the modeling section. The sam-        revealed and participants received feedback on their choice or\npling goal was manipulated between participants who either            estimate. If their estimate was correct, their potential bonus\nhad to estimate the overall value of q (estimation condition)         was recorded as the bonus that remained after the sampling\nor decide whether q was greater or lower than 0.5 (binary             phase, otherwise the it was recorded as $0. At the end of the\ncondition).                                                           task, one card deck was chosen at random and participants\n   We predicted that sampling goals would affect both the             were actually paid the bonus earned on that deck.\nnumber of samples collected on average (higher for the es-            Results & Discussion To recap, our two main predictions\ntimation vs. binary goal), and the relationship between stop-         motivated by the modeling were that participants in the es-\nping points and current sample composition. As outlined in            timation conditions would on average collect larger sam-\nthe previous section, we expected participants engaged in bi-         ples, and that participants in the binary conditions would be\nnary sampling to be more likely to stop early when strong             strongly influenced by the composition of the current sample\nevidence is encountered (average closer to 0 or 1) and more           when deciding whether to stop or to continue sampling. Fig-\nlikely to continue when evidence is mixed (average closer to          ure 3A shows the distribution of sample sizes by condition.\n0.5).                                                                 As expected (compared to model predictions in Figure 2A),\n                                                                      participants in the estimation group took larger samples than\nParticipants 276 participants were recruited via Amazon\n                                                                      participants in the binary group (t(211) = 11.18, p < 0.01),\nMechanical Turk. They were paid $2 for participating with an\n                                                                      suggesting that people were aware of the trade-off between\noption to win a bonus of up to another $2 (explained below).\n                                                                      sampling cost and accuracy and were willing to incur higher\nStimuli Participants were told that they were repeatedly              cost (more samples) in the more difficult task. There were\ndrawing cards from 50 different card decks consisting of 200          also visible spikes for certain sample sizes (8, 10, and 12) in\ncards each. Cards could be either red or blue, and the distribu-      the estimation condition, suggesting that perhaps these were\ntion of red and blue cards in each deck was determined semi-          preferred, salient stopping points for a range of participants\nuniformly (using an evenly-spaced distribution of Bernoulli           (cards on the screen were aligned in columns of four, so\nprobabilities q that were then used to randomly draw the cards        spikes at 8 and 12 may be the result of some aesthetically\nfor each deck). Participants were explicitly told to assume a         inspired fixed-sample-size stopping rule).\nuniform distribution of numbers of red and blue cards in each            Figure 4 shows the proportion of times participants ended\ndeck, as well as being told that the order of cards in each deck      up in each state after terminating search. There was a clear\nwas completely random (“well shuffled”).                              difference between the stopping patterns of the two groups.\nProcedure For each card deck, participants could repeat-              Participants in the binary group were more likely to stop in\nedly (up to 24 times) turn over cards using a button press to         early extreme states, but continued sampling if early evidence\nreveal their color. A counter on the screen would tell how            was mixed. Participants in the estimation group, on the other\nmuch of potential bonus remained after each sample (which             hand, showed no discernable stopping pattern based on cur-\ncost $0.05). For each card deck, the potential bonus started          rent sample composition. For a given sample size, there ap-\nat $2. At any point participants could also decide to move            peared to be fairly equal stopping probability across different\non to the secondary task (binary choice or estimation) via a          proportions of red/blue cards. Also, the previously mentioned\ndifferent button. In the binary task, participants would then         average preference for certain sample sizes is reflected in di-\nmake a two alternative forced choice decision of whether they         agonal “ridges” in the estimation goal data. What we did not\nthought there were more red or more blue cards in the deck.           observe were the earlier stopping patterns for very mixed or\nIn the estimation task they gave an exact estimate using a bar        very extreme samples, which were predicted by the model.\n                                                                   2822\n"],"5":["                                                                                 extreme (even higher, and even lower) as a consequence.\n                          binary                         estimate\n             20\n                                                                                 Participants 58 participants were recruited via Amazon\n             15                                                                  Mechanical Turk and paid $2 for participation (plus bonus).\n red cards\n             10\n                                                                                 Stimuli To encourage participants to form summary\n              5\n                                                                                 representations of two separate distributions a cover story\n                                                                                 asked them to repeatedly sample binary results (correct or\n              0\n                                                                                 incorrect test scores) from a set of high school students,\n                  0   5    10      15   20   0       5     10       15   20\n                                        blue cards                               who were each taught by one of two teachers (teacher A\n                                                                                 or teacher B). That is, rather than randomly and uniformly\nFigure 4: Stopping probabilities (dark means high) by sampling                   drawing values for q for each student (as in Experiment\ngoal in Experiment 1                                                             1), outcome probabilities were now drawn from one of two\n                                                                                 hierarchical distributions. The mean accuracy of students\n                                                                                 from each teacher differed, such that one teacher yielded a\nPossibly participants were unaware of the differences in un-                     higher average (µhigh = 0.7) of correct test scores than the\ncertainty about the true average that emerge as a consequence                    other (µlow = 0.3). Individual students’ outcome probabilities\nof the sample composition.                                                       were distributed as q ⇠ Beta(3µt , 3(1 µt )), depending on\n   Finally, we also examined the sample composition result-                      a student’s teacher type, t 2 {high, low}. Participants were\ning from these stopping rule differences. Figure 3B shows                        each given different random draws from this distribution.\nthe distribution of sample averages by condition. The binary\nsampling group showed a much larger proportion of extreme\nsamples (all red/blue) compared to the estimation condition.                     Procedure The main part of the experiment was similar to\nIn summary, people’s stopping decisions lead to differences                      that of the model and previous experiment. Participants re-\nin the resulting sample content in a manner that is qualita-                     peatedly sampled 100 students’ test answers (correct or in-\ntively consistent with the model predictions.                                    correct), while losing $0.05 per question from a potential $2\n                                                                                 bonus per student. Each student was presented along with\nExperiment 2                                                                     their respective teacher, which alternated between teacher A\nExperiment 1 established that people adapt their stopping rule                   and B. Participants were again assigned to a binary choice or\nto different sampling goals in a way that is broadly consistent                  estimation condition, but unlike in the previous experiment\nwith the predictions of our optimal stopping analysis. How-                      they did not receive feedback on the true distribution for every\never collecting a sample is usually not the end goal of learn-                   student. After sampling 50 students per teacher, participants\ning. Instead learners use a sample to enable predictions about                   also rated the average quality of each teacher’s students (us-\nmore general properties of the world. For example, people                        ing a slider between 0% and 100% correct). Again, they were\nmight listen to a few songs by a band then attempt to gen-                       paid a bonus based on one randomly chosen student from the\neralize from those song to the entire catalog. Experiment 2                      sampling task.\nwas designed to explore how goal-induced stopping rule dif-                          A              1500                             B                                          H                            L\n                                                                                                                                     S. mean − overall mean\nferences might affect people’s subsequent judgments of more\n                                                                                                                          binary\n                                                                                                                                                                      ●\n                                                                                                    1000                                                              ● ●\n                                                                                                                                                                      ● ●\n                                                                                     Participants\n                                                                                                                                                                                      ●●\ngeneral population parameters.\n                                                                                                                                                                            ●\n                                                                                                     500                                                       0.05       ●\n                                                                                                                                                                         ●● ●\n                                                                                                                                                                                           ●\n                                                                                                                                                                                           ●                      ● ●\n                                                                                                                                                                          ● ●           ● ●\n                                                                                                                                                                      ● ●● ●\n                                                                                                       0                                                                 ●              ● ●\n   A critical challenge was ensuring that participants were\n                                                                                                                                                                       ●●● ●         ●●    ●\n                                                                                                    1500                                                              ● ●            ●● ●●\n                                                                                                                                                                                     ●●●●●\n                                                                                                                                                                                          ●\n                                                                                                                                                                                                   ●                   ●●\n                                                                                                                                                               0.00                                     ●         ●●●●●\n                                                                                                                          estimate\n                                                                                                                                                                                       ● ●             ●●\n                                                                                                                                                                                                       ●           ●   ●●●\n                                                                                                                                                                                                                         ●\n                                                                                                                                                                                     ● ●●●●         ●●            ●\n                                                                                                                                                                                                                  ●●   ●\n                                                                                                                                                                                                                  ●●\n                                                                                                    1000                                                                                             ●●\nmotivated to learn more general properties from the samples                                                                                                                                              ●            ●●\n                                                                                                                                                                                                         ●         ●\n                                                                                                                                                                                                      ●●             ●●●\n                                                                                                                                                                                                                         ●\n                                                                                                     500                                                      −0.05                                  ●\n                                                                                                                                                                                                     ●●●\n                                                                                                                                                                                                        ●\n                                                                                                                                                                                                                  ●\nthey collected. To that end, we altered the Experiment 1 de-\n                                                                                                                                                                                                       ●\n                                                                                                                                                                                                         ●\n                                                                                                       0                                                                                               ●●\n                                                                                                                                                                                                   ●●\n                                                                                                           0 5 10 15 20 25\nsign by grouping samples under two different generative pro-                                                Sample size                                               binary        estimate      binary         estimate\n                                                                                                                                                                                           condition\ncesses (specifically two different schoolteachers who had the\nability to influence the test scores of students in their class).                Figure 5: A: Number of samples collected in Experiment 2. B:\nThe intention was to encourage participants to form summary                      Difference between mean of the sampling means, and mean of all\n                                                                                 samples by condition and teacher type (High or Low).\nrepresentations of these parameters based on the samples col-\nlected for each. By varying the average outcome probabili-\nties of these two groups/parameters (one high, one low), we                      Results & Discussion Figure 5A shows the distribution of\nwould then be able to compare the potential impact of sam-                       sample size by condition and Figure 6 depicts participants’\npling goals on the estimates of each group’s average. We ex-                     stopping probabilities by state. Despite substantial changes\npected binary samplers to be exposed to a greater difference                     compared to Experiment 1 (addition of teachers, two differ-\nbetween outcome probabilities due to a stopping rule that                        ent outcome distributions, omission of feedback) the results\nleads to more extreme outcomes and wanted to know if this                        are qualitatively similar. Again, binary learners took smaller\nwould bias their population estimates to also be more more                       samples on average and were more likely to stop given highly\n                                                                              2823\n"],"6":["                                binary                            estimate\n                                                                                                                    Discussion\n                   25                                                                     In this paper, we presented a theoretical analysis showing\n                   20\n                                                                                          how sampling goals can have a profound impact on people’s\n                                                                                          stopping strategies even under natural sampling. Crucially,\n correct answers\n                   15\n                                                                                          our results go beyond showing a difference in the amount\n                   10                                                                     of evidence collected, but demonstrate that goals also affect\n                                                                                          also the composition and statistical properties of samples.\n                    5\n                                                                                          This demonstrates that natural sampling does not necessarily\n                    0                                                                     produce samples that mirror the statistical properties of the\n                        0   5   10       15     20     0     5     10        15   20      environment. Instead, just the simple decision of when to\n                                              incorrect answers                           stop sampling can lead people to collect samples with vastly\n                                                                                          different distributional characteristics depending on their\nFigure 6: Stopping probabilities (dark means high) by sampling                            goal. While Experiment 2 did not show a robust effect of this\ngoal in Experiment 2.                                                                     non-representative sampling on more general predictions, it\n                                                                                          is an interesting question if people can take into account the\n                                                                                          process by which samples were gathered and perform the\nunbalanced samples (all correct or all incorrect).                                        necessary correction to remove possible biases. Prior work\n   Next, we considered the impact of stopping on the evidence                             on sampling and estimating binary outcomes suggests that\ncollected for each of the teachers. Because each participant                              this might be difficult for people (Fiedler, 2008; Griffin &\nsaw a different sequence of outcomes and the resulting dis-                               Tversky, 1992). If this turns out to be more generally true, it\ntribution of samples varied as a consequence, we developed                                suggest that simply deciding when to stop sampling informa-\nthe following measure of a participants’ potential for being                              tion from a natural process can strongly bias judgement.\nbiased given the data they saw: For each participant, we com-\nputed the difference between the average sample mean for                                    Acknowledgments This work was supported by grant\neach teacher and the overall teacher average irrespective of                              number BCS-1255538 from the National Science Foundation\nthe sample boundaries (i.e. treating all students as one sam-                             and a John S. McDonnell Foundation Scholar Award to TMG.\nple). This difference is 0 when a participant always takes\nsamples of the same size, but may diverge when sample sizes\n                                                                                                                    References\n                                                                                          Denrell, J. (2003). Vicarious learning, undersampling of failure, and\nare uneven, particularly when sample size and sample mean                                   the myths of management. Organization Science, 14(3), 227–\nare non-independent, as we expect to happen under binary                                    243.\nsampling. Figure 5B shows this difference by teacher and                                  Denrell, J., & March, J. G. (2001). Adaptation as information re-\ncondition. As expected, in the binary condition, the average                                striction: The hot stove effect. Organization Science, 12(5), 523–\n                                                                                            538.\nsample mean was more extreme (higher for the good teacher,                                Ferguson, T. S.             (2012).        Optimal stopping and\nlower for the bad teacher) than the overall average, compared                               applications.          Electronic Text.          Retrieved from\nto the estimation condition, (significant condition and teacher                             https://www.math.ucla.edu/ tom/Stopping/Contents.html\ntype interaction, t(98) = 5.62, p < 0.01), indicating again that\n                                                                                          Fiedler, K. (2008). The ultimate sampling dilemma in experience-\nstopping rules affected the sample distribution.                                             based decision making. Journal of Experimental Psychology:\n   Next, we tried to investigate the impact of this difference                               Learning, Memory, and Cognition, 34(1), 186.\n                                                                                          Griffin, D., & Tversky, A. (1992). The weighing of evidence and the\non people’s subsequent judgments of the teachers. To do so,                                  determinants of confidence. Cognitive psychology, 24(3), 411–\nwe regressed participants’ posterior estimates of the teacher                                435.\nmean (one estimates per participant per teacher) on their over-                           Juni, M. Z., Gureckis, T. M., & Maloney, L. T. (in press). Informa-\nall teacher mean and the difference between overall mean                                     tion sampling behavior with explicit sampling costs. Decision.\nand average sample mean (from Figure 5B). If the latter had                               Lee, M. D., & Paradowski, M. J. (2007). Group decision-making on\n                                                                                             an optimal stopping problem. The Journal of Problem Solving,\nany additional positive effect of peoples estimates beyond the                               1(2), 06.\noverall mean, this would indicate that participants were not                              Le Mens, G., & Denrell, J. (2011). Rational learning and informa-\ncorrecting for the unequal sample sizes that introduced this                                 tion sampling: On the naivety assumption in sampling explana-\n                                                                                             tions of judgment biases. Psychological review, 118(2), 379.\ndifference. However, we failed to find a significant positive\n                                                                                          Rich, A. S., & Gureckis, T. M. (2014). The value of approaching\neffect of the difference, t(99) = 1.627, p = 0.11. Due to con-                               bad things. In P. Bello, M. Guarini, M. McShane, & B. Scassellati\nsiderable variation in the actual outcomes observed by each                                  (Eds.), Proceedings of the 36rd annual conference of the cognitive\nparticipant (all received different sequences) and the high                                  science society. Austin, TX.\nvariability of theses posterior estimates, it may be that we                              Vul, E., Goodman, N., Griffiths, T. L., & Tenenbaum, J. B. (2014).\n                                                                                             One and done? optimal decisions from very few samples. Cogni-\nlacked sufficient statistical power to detect this effect. We                                tive science, 38(4), 599–637.\nare currently working towards an improved design of this\nstudy that reduces variance in people’s posterior estimates of\nteacher quality and their sample composition.\n                                                                                       2824\n"]}
